Documents/ЗаявкаНаВыводОНВПродажу.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<Document>
		<Properties>
			<Name>ЗаявкаНаВыводОНВПродажу</Name>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ОбъектНедвижимости</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОбъектыНедвижимости</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыОперацийЗаявкиНаВыводОНВПродажу</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусЗаявкиНаВыводОНВПродажу</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПоследнегоОбновленияИзУПН</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрочныйВывод</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/Квартирограмма.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<InformationRegister>
		<Properties>
			<Name>Квартирограмма</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Корпус</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КорпусаОбъектовСтроительства</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Этаж</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Подъезд</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подъезды</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГруппаПравообладателя</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыПравообладателя</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерКвартиры</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>5</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерНаПлощадке</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипОтделки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыОтделки</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыОбъектовНедвижимости</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РасшифровкаСтатуса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыРезервов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Блок</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтроительныйНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Площадь</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЦенаОтделкиЗаМетр</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Стоимость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЦенаЗаМетр</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МаксимальнаяСкидка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МаксимальнаяСкидкаССубсидией</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоКомнат</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Комнатность</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаСтартаПродаж</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтатусПула</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыПулов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Услуги</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПлощадьПроектная</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>16</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ОбъектНедвижимости</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОбъектыНедвижимости</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектСтроительства</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОбъектыСтроительства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/СтатусыОбъектовНедвижимости.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<InformationRegister>
		<Properties>
			<Name>СтатусыОбъектовНедвижимости</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыОбъектовНедвижимости</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДокументРегистратор</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Бронирование</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаявкаНаСделку</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ОбъектНедвижимости</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОбъектыНедвижимости</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/СтатусЗаявкиНаВыводОНВПродажу.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<Enum>
		<Properties>
			<Name>СтатусЗаявкиНаВыводОНВПродажу</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>СогласованиеЗаявки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СогласованаРуководителемФилиала</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтклоненаРуководителемФилиала</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыполненаВОКМЦ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтклоненаВОКМЦ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаСогласованииВОКМЦ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаСогласованииРуководителемВДИН</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаСогласованииСотрудникомВДИН</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СогласованаВДИН</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтклоненаВДИН</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ТипыОперацийЗаявкиНаВыводОНВПродажу.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<Enum>
		<Properties>
			<Name>ТипыОперацийЗаявкиНаВыводОНВПродажу</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВыводВПродажу</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УзнатьЦену</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ЗаявкаНаВыводОНВПродажу/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;		
	
	НовыйДокумент = Параметры.Ключ.Пустая();
	
	Если НовыйДокумент Тогда
		Если Параметры.Свойство("ОбъектНедвижимости") Тогда
			Объект.ОбъектНедвижимости = Параметры.ОбъектНедвижимости;	
		КонецЕсли;
		Объект.Ответственный 	= ПараметрыСеанса.ТекущийПользователь;	
		Объект.Автор		 	= ПараметрыСеанса.ТекущийПользователь;
		Объект.Статус 			= Перечисления.СтатусЗаявкиНаВыводОНВПродажу.СогласованиеЗаявки;
		Объект.ТипОперации 		= Перечисления.ТипыОперацийЗаявкиНаВыводОНВПродажу.ВыводВПродажу;
		ОбновитьДанныеОбъектаНедвижимостиНаСервере();
	КонецЕсли; 	
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)

	ОбновитьДанныеОбъектаНедвижимостиНаСервере();
	
	СтатусДоЗаписи = Объект.Статус;
	
	Если Объект.Статус <> Перечисления.СтатусЗаявкиНаВыводОНВПродажу.СогласованиеЗаявки Тогда
	
		ЭтотОбъект.ТолькоПросмотр = Истина;	
		
		Элементы.ФормаСогласовать.Доступность = Ложь;
		Элементы.ФормаОтклонить.Доступность = Ложь;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	//При записи нового документа
	Если НовыйДокумент Тогда
		НовыйДокумент = Ложь;
		ВыполнитьРассылкуНаСервере();
	КонецЕсли;	
	
	//Если изменился статут с согласования на тот, что отметил руководитель
	Если СтатусДоЗаписи = Перечисления.СтатусЗаявкиНаВыводОНВПродажу.СогласованиеЗаявки
			И (Объект.Статус = Перечисления.СтатусЗаявкиНаВыводОНВПродажу.СогласованаРуководителемФилиала
					ИЛИ Объект.Статус = Перечисления.СтатусЗаявкиНаВыводОНВПродажу.ОтклоненаРуководителемФилиала) Тогда
		СтатусДоЗаписи = Объект.Статус;
		ВыполнитьРассылкуНаСервере(Ложь);	
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОбъектНедвижимостиПриИзменении(Элемент)
	
	ОбновитьДанныеОбъектаНедвижимостиНаСервере();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Согласовать(Команда)
	
	СогласоватьНаСервере("СогласованаРуководителемФилиала");
	
КонецПроцедуры

&НаКлиенте
Процедура Отклонить(Команда)
	
	СогласоватьНаСервере("ОтклоненаРуководителемФилиала");
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОбновитьДанныеОбъектаНедвижимостиНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СтатусыОбъектовНедвижимостиСрезПоследних.Статус КАК СтатусОбъектаНедвижимости,
	|	Квартирограмма.Стоимость КАК Стоимость,
	|	Квартирограмма.ДатаСтартаПродаж КАК ДатаВыводаВПул,
	|	Квартирограмма.СтатусПула КАК СтатусПула
	|ИЗ
	|	РегистрСведений.Квартирограмма КАК Квартирограмма
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтатусыОбъектовНедвижимости.СрезПоследних(, ОбъектНедвижимости = &ОбъектНедвижимости) КАК СтатусыОбъектовНедвижимостиСрезПоследних
	|		ПО Квартирограмма.ОбъектНедвижимости = СтатусыОбъектовНедвижимостиСрезПоследних.ОбъектНедвижимости
	|ГДЕ
	|	Квартирограмма.ОбъектНедвижимости = &ОбъектНедвижимости";
	
	Запрос.УстановитьПараметр("ОбъектНедвижимости", Объект.ОбъектНедвижимости);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		ЗаполнитьЗначенияСвойств(ЭтаФорма, Выборка);				
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Процедура СогласоватьНаСервере(Знач Статус)
	
	Объект.Статус 				= Перечисления.СтатусЗаявкиНаВыводОНВПродажу[Статус];
	ЭтаФорма.Записать();
	ЭтаФорма.ТолькоПросмотр 	= Истина;
	
КонецПроцедуры

&НаСервере
Процедура ВыполнитьРассылкуНаСервере(ДляРуководителя = Истина)

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ОбъектыНедвижимости.Владелец.Проект.Руководитель КАК Руководитель,
	|	ПредставлениеСсылки(ОбъектыНедвижимости.Ссылка) КАК ОбъектНедвижимости,
	|	ПредставлениеСсылки(ОбъектыНедвижимости.Владелец) КАК ОбъектСтроительства,
	|	ПредставлениеСсылки(Клиенты.Ссылка) КАК Клиент,
	|	Клиенты.ОсновнойТелефон КАК Телефон
	|ИЗ
	|	Справочник.ОбъектыНедвижимости КАК ОбъектыНедвижимости,
	|	Справочник.Клиенты КАК Клиенты
	|ГДЕ
	|	ОбъектыНедвижимости.Ссылка = &ОН
	|	И Клиенты.Ссылка = &Клиент";
	Запрос.УстановитьПараметр("ОН", 	Объект.ОбъектНедвижимости);
	Запрос.УстановитьПараметр("Клиент", Объект.Клиент);
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		Если НЕ ЗначениеЗаполнено(Выборка.Руководитель) Тогда
			Возврат;
		КонецЕсли;
		
		СистемнаяУчетнаяЗаписьEMAIL = Справочники.УчетныеЗаписиЭлектроннойПочты.СистемнаяУчетнаяЗаписьЭлектроннойПочты;			
		EMAILАдрес 					= УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(?(ДляРуководителя, Выборка.Руководитель, Объект.Автор), 
																									Справочники.ВидыКонтактнойИнформации.EmailПользователя);
																									
																									
		ПараметрыСообщения = Новый Структура;
		ПараметрыСообщения.Вставить("Кому", EMAILАдрес);
																									
		Если ДляРуководителя Тогда 																									
			Тело = "Необходимо рассмотреть заявку на вывод в пул ";
			ПараметрыСообщения.Вставить("Тема", "Согласование на вывод ОН в продажу");
		Иначе
			Тело = ?(Объект.Статус = Перечисления.СтатусЗаявкиНаВыводОНВПродажу.СогласованаРуководителемФилиала, "Согласована руководителем", "Отклонена руководителем") 
						+ " заявка на вывод в пул ";
			ПараметрыСообщения.Вставить("Тема", ?(Объект.Статус = Перечисления.СтатусЗаявкиНаВыводОНВПродажу.СогласованаРуководителемФилиала, "Согласована руководителем", "Отклонена руководителем") + " заявка на вывод ОН в продажу");
		КонецЕсли;											
		
		Тело = Тело + Строка(Объект.Номер) + " от " + Формат(Объект.Дата, "ДФ=dd.MM.yyyy")
						+ " по ОН: " + Выборка.ОбъектНедвижимости  
						+ " " + Выборка.ОбъектСтроительства + "; " 
						+ " по клиенту "  
						+ Выборка.Клиент + " " + Выборка.Телефон;
		
		ПараметрыСообщения.Вставить("Тело", Тело);
		
		Попытка
			РаботаСПочтовымиСообщениями.ОтправитьПочтовоеСообщение(СистемнаяУчетнаяЗаписьEMAIL, ПараметрыСообщения);
		Исключение
			//ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		КонецПопытки;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
